    /* функція створює та виносить вниз вертикально наступний рівень 
    вкладеного списку та згортає список в разі натискання куросору на сторінці*/

    $(document).ready(function(){
        /*головна функція - готова до дії*/

      $('.ah-dropdown-submenu a.test').on("click", function(list){
        /*функція звернення до позиції класу в списку - підменю*/

        $(this).next('ul').toggle();
        /*при натисканні сюди - на заголовок меню, викидає підменю*/

        list.stopPropagation();
        /*зупиняє розширення меню*/
        
        list.preventDefault();
        /*спрацьовує, якщо не припиняється розширення меню*/
      });
    });
    